[
  {
    "url": "https://x.com/garrytan/status/2023518514120937672",
    "title": "@garrytan on X — Garry Tan (YC President)",
    "date": "17/02/2026 - 13:14",
    "summary": "Tweet by Garry Tan, President of Y Combinator. Content not available via web scraping due to X's restrictions — open the link directly to read the full post.",
    "tags": ["startup", "vc"]
  },
  {
    "url": "https://www.linkedin.com/posts/vibegui_the-most-productive-thing-i-did-today-was-activity-7429359346947497984-UjXQ",
    "title": "The Most Productive Thing I Did Today Was Answer Questions — Guilherme Rodrigues",
    "date": "17/02/2026 - 13:14",
    "summary": "Guilherme Rodrigues (vibegui) shares his experience adopting Get Shit Done (GSD), a meta-prompting and spec-driven development plugin for Claude Code. He argues that the most productive thing he did was simply answering the right questions — GSD's approach forces you to clearly define what you want before the AI starts coding, which leads to dramatically better output. The post sparked discussion in the comments about budget management with Claude (API costs can add up fast), whether GSD outperforms Claude's built-in plan/tasks system, and how designers still prefer IDE + browser for visual iteration. Multiple engineers confirmed they added GSD to their daily stack after trying it.",
    "tags": ["ai", "productivity", "engineering"]
  },
  {
    "url": "https://x.com/amirmxt/status/2023459550767288594",
    "title": "@amirmxt on X",
    "date": "17/02/2026 - 13:14",
    "summary": "Tweet by amirmxt. Content not available via web scraping due to X's restrictions — open the link directly to read the full post.",
    "tags": ["ai"]
  },
  {
    "url": "https://ideas.fin.ai/p/a-tale-of-two-agent-builders",
    "title": "A Tale of Two Agent Builders",
    "date": "13/10/2025 - 01:00",
    "summary": "This article compares two fundamentally different approaches to building AI agent configuration interfaces, released in the same week: OpenAI's canvas-based Agent Builder and Intercom/Fin's document-based Procedures.\n\nOpenAI's Agent Builder uses the classic 'nodes and noodles' visual workflow pattern — a canvas where you drag, connect, and configure logic gates in an if-then-else flow. It's a well-established pattern (Zapier, n8n, Scratch, Quartz Composer) but inherently deterministic. The initial reaction was mixed: it felt like squeezing massively capable agentic systems through narrow logic gates. As workflows grow complex, they become spaghetti. LLMs work well with language, not flowcharts.\n\nFin's Procedures takes the opposite approach: a document-based editor inspired by Jupyter Notebooks and Notion. You start by describing what you want in plain English (probabilistic), then progressively add deterministic elements inline — branching logic, data connectors, code blocks — only when needed. It's a blend of agentic and specific.\n\nThe deeper insight is about the central UI design challenge of the AI era: how do we combine deterministic interfaces (predictable, if-then-else) with probabilistic ones (fuzzy, AI-driven)? The author argues the best future interfaces will gracefully blend both. OpenAI is building generic multi-agent infrastructure; Fin is building domain-specific customer support tooling — different goals that explain different design choices.",
    "tags": ["ai", "design", "product"]
  },
  {
    "url": "https://blog.cloudflare.com/code-mode/",
    "title": "Code Mode: the better way to use MCP",
    "date": "12/10/2025 - 16:56",
    "summary": "Cloudflare's engineering team discovered that the standard way everyone uses MCP (Model Context Protocol) is suboptimal. Instead of exposing tools directly to the LLM for function calling, they convert MCP tools into a TypeScript API and ask the LLM to write code that calls that API.\n\nThe results are striking for two reasons:\n\n1. LLMs handle far more tools, and more complex tools, when presented as TypeScript interfaces. This is likely because LLMs have trained on enormous amounts of real-world TypeScript code, but only on a small set of contrived tool-call examples. Tool calling uses special tokens the LLM has rarely seen in the wild.\n\n2. The approach dramatically improves multi-step workflows. With traditional tool calling, the output of each call feeds back through the LLM's neural network just to be copied to the next call — wasting time, energy, and tokens. When the LLM writes code, it can chain calls directly and only read back the final results.\n\nThe article dives deep into how tool calling actually works under the hood (special tokens, JSON payloads, harness pausing), why it's inherently limited compared to code generation, and how 'Code Mode' changes the game for building complex AI agents. In short: LLMs are better at writing code to call MCP than at calling MCP directly.",
    "tags": ["ai", "engineering", "frontend"]
  },
  {
    "url": "https://www.kalzumeus.com/2009/12/31/engineering-your-way-to-marketing-success/",
    "title": "Engineering Your Way To Marketing Success",
    "date": "11/08/2025 - 13:56",
    "summary": "Patrick McKenzie (patio11) makes the case that engineers should stop building features nobody uses and start deploying their skills for marketing. The core insight: we sit on more software and programmer brainpower than Saudi Arabia has oil, yet we waste it building marginal features instead of systems that actually sell.\n\nHe shares a painful personal example: spending enormous time on client/server sync for Bingo Card Creator (used by 22 customers — 1% adoption) versus adding color support (took 1/10th the time, used by 8.5% of customers). Features don't sell software — benefits do.\n\nThe article covers several engineering-to-marketing conversions: automated SEO at scale, A/B testing everything relentlessly, building analytics systems that answer 'Do customers feel like they just killed a lion?', creating content generation pipelines (he wrote 28,761 words of bingo content — a young-adult novel's worth), and building tools that let non-engineers run experiments. The key insight is building tools and processes as force multipliers — decoupling productivity from hours worked. Instead of grinding out content yourself, build a system that lets someone else do it while you build more force multipliers.",
    "tags": ["marketing", "engineering", "startup"]
  },
  {
    "url": "https://alexw.substack.com/p/do-too-much",
    "title": "DO TOO MUCH",
    "date": "10/08/2025 - 23:06",
    "summary": "Alex Wang, CEO of Scale AI, argues that extraordinary results require what most people would call excessive effort — but 'too much' is actually the right amount.\n\nAs a leader, you are the upper bound for how much anyone in your company will care. His reframes:\n- What people call overoptimism is just optimism\n- What people call overcommunicating is just communicating\n- What people call overdelivering is just delivering\n- What people call micromanagement is just management\n- What people call ruthless prioritization is just prioritization\n\nThere is no Apple without Jobs's 'obsessive' attention to detail. No SpaceX without Elon's 'maniacal' drive. Ordinary effort never leads to extraordinary results.\n\nThe concrete example: when generative AI took off in 2022, Scale shifted the vast majority of their team to LLM data work within 6 months. Most companies would spend quarters in planning cycles. What looked like overreacting was just reacting — and that speed made Scale's 4X growth possible. Creating something meaningful is beautiful, scary, and painful. If you're not overdoing it, you're underdoing it.",
    "tags": ["leadership", "startup", "productivity"]
  },
  {
    "url": "https://zenorocha.com/the-heartbeat-framework",
    "title": "The Heartbeat Framework — Zeno Rocha",
    "date": "10/08/2025 - 22:55",
    "summary": "Zeno Rocha, founder of Resend, codifies how startups maintain momentum into a framework he calls 'The Heartbeat.' The core premise: getting momentum is extremely hard, losing it is very easy. As makers, you have to ship AND talk about it constantly to create a feeling of 'always shipping.'\n\nThe framework works like an actual heartbeat — big peaks followed by small peaks, with the beat always present. A flat line means you're dead.\n\nThe six layers, from highest to lowest frequency:\n\nA) Launch Weeks (2-3x/year) — The big peaks. 5 new features in 5 days. Most impactful but highest cost to the team.\nB) Mini-Launches (4-5x/year) — Small wins worth sharing in detail, without the full coordination overhead.\nC) Changelogs (1-2x/month) — Regular product updates. Create internal streaks to motivate the team.\nD) Blog posts (1-2x/month) — Nothing's more telling than a company blog with the last post from a year ago.\nE) Customer stories (1-2x/month) — Real developer experiences. Crucial for attracting new customers and keeping the team motivated.\nF) Social posts (1x/day) — Be very active in only a few places. For Resend, X and LinkedIn worked best.\n\nThe key: startups are all about momentum. Don't lose it once you find it.",
    "tags": ["marketing", "startup", "product"]
  },
  {
    "url": "https://www.youtube.com/watch?v=_yhSh4g0NSk",
    "title": "I Hate Next.js 13 Caching Even More Now",
    "date": "10/08/2025 - 22:45",
    "summary": "A YouTube video deep-diving into the frustrations developers face with Next.js 13's caching system. The caching in Next.js 13 introduced multiple layers (Data Cache, Full Route Cache, Router Cache) that interact in complex and often surprising ways. The video walks through real scenarios where caching behavior is unintuitive, stale data appears unexpectedly, and developers spend more time fighting the cache than building features. A widely-shared critique that resonated with the React/Next.js community.",
    "tags": ["frontend", "engineering"]
  },
  {
    "url": "https://buka.studio/",
    "title": "Buka Studio",
    "date": "10/08/2025 - 22:35",
    "summary": "Buka Studio (ブカ) is a design-development duo based in Croatia — Marijana (designer) and Robert (developer). They help founders turn ideas into products and brands, working closely with teams they believe in.\n\nTheir philosophy centers on projects where design and code move together, so nothing gets lost in translation. They dive in fast and explore broadly, whether shaping early ideas, refining products in production, or crafting bold visuals for one-off moments. Everything needs to feel cohesive and on-brand. A good reference for what a small, focused, high-quality product studio looks like.",
    "tags": ["design", "startup"]
  }
]
