[
  {
    "url": "https://x.com/garrytan/status/2023518514120937672",
    "title": "@garrytan — Personal agent software is the new meta of 2026",
    "date": "17/02/2026 - 13:14",
    "summary": "Garry Tan (President & CEO of Y Combinator) shares his excitement about a new trend he's seeing in 2026: personal agent software that you install and run locally on your own computer. He calls it 'one of my favorite new metas of 2026' and argues that placing agent power on the user's own machine — rather than in the cloud — fundamentally empowers every user.\n\nHe links to Ironclaw (ironclaw.sh), an AI CRM that runs locally on Mac, as an example of this trend. The post resonated massively: 293K views, 1.6K likes, 1.9K bookmarks.\n\nThe replies are interesting too — jacopo.eth clarifies that Ironclaw is actually a nearai/ironclaw Rust implementation inspired by OpenClaw, focused on privacy. Other replies mention similar local-first agent projects like Iris (a Jarvis-like companion with a mobile app for remote comms to a desktop agent). The thread captures the growing momentum around local-first, privacy-respecting AI agents as an alternative to cloud-dependent SaaS.",
    "tags": ["ai", "startup", "vc"]
  },
  {
    "url": "https://www.linkedin.com/posts/vibegui_the-most-productive-thing-i-did-today-was-activity-7429359346947497984-UjXQ",
    "title": "The Most Productive Thing I Did Today Was Answer Questions — Guilherme Rodrigues",
    "date": "17/02/2026 - 13:14",
    "summary": "Guilherme Rodrigues (vibegui) shares his experience adopting Get Shit Done (GSD), a meta-prompting and spec-driven development plugin for Claude Code. His core thesis: the most productive thing he did wasn't writing code — it was answering the right questions. GSD's approach forces you to clearly define what you want before the AI starts coding, which leads to dramatically better output compared to just prompting Claude directly.\n\nThe post links to his article 'The Most Productive Thing I Did Today Was Answer Questions' on vibegui.com, where he goes deeper into the workflow. The LinkedIn comments sparked interesting discussion: one person asks about budget management (Claude API costs can burn fast — 'o Claude chiou demais aqui' 💸), a designer notes they still prefer IDE + browser for visual iteration, and several engineers confirm GSD entered their daily stack immediately after trying it. One commenter asks whether GSD works better than Claude's built-in plan/tasks system, and another asks if it scales across multiple parallel projects.",
    "tags": ["ai", "productivity", "engineering"]
  },
  {
    "url": "https://x.com/amirmxt/status/2023459550767288594",
    "title": "@amirmxt — Running an entire GTM campaign without leaving the terminal",
    "date": "17/02/2026 - 13:14",
    "summary": "amirmxt shares a detailed walkthrough of running an entire Go-To-Market campaign using AI agents directly from the terminal, without ever opening a browser manually. The workflow has four steps:\n\n1) Lead enrichment with Firecrawl — not just names and emails but firmographics, tech stacks, and company signals. Thousands of leads categorized and segmented in minutes.\n\n2) Campaign building with Claude — Claude opened a browser, navigated to hunter.io, and built email campaigns directly inside Hunter's editor. It wrote personalized email sequences (subject lines, body copy, follow-ups) tailored to each segment.\n\n3) Review — amirmxt sat and reviewed 7 campaigns, checked targeting, tweaked subject lines, shortened emails that were too long. Claude handled the edits too — navigated back into each campaign and swapped in simplified versions.\n\n4) Publish — everything went live. 2,700+ leads across 6 lists, 7 active campaigns all running.\n\nHis key insight: 'the bottleneck isn't execution anymore — it's knowing what to build.' The post got 137K views and 1.6K bookmarks. In the replies, Dante Rebelo pushes back saying AI-generated 'personalized' outreach is still 'obviously AI slop,' and amirmxt responds honestly that he tries to write emails in his own tone — using agents mainly for setup and enrichment, not the actual copy.",
    "tags": ["ai", "marketing", "startup"]
  },
  {
    "url": "https://ideas.fin.ai/p/a-tale-of-two-agent-builders",
    "title": "A Tale of Two Agent Builders",
    "date": "13/10/2025 - 01:00",
    "summary": "This article compares two fundamentally different approaches to building AI agent configuration interfaces, released in the same week: OpenAI's canvas-based Agent Builder and Intercom/Fin's document-based Procedures.\n\nOpenAI's Agent Builder uses the classic 'nodes and noodles' visual workflow pattern — a canvas where you drag, connect, and configure logic gates in an if-then-else flow. It's a well-established pattern with deep roots (Quartz Composer, Max/MSP, Scratch, Zapier, n8n) but inherently deterministic. The initial reaction was mixed: it felt like squeezing massively capable agentic systems through narrow logic gates. As workflows grow complex, they become spaghetti. LLMs work well with language, not flowcharts. Impressively (or tellingly), it was built in just six weeks.\n\nFin's Procedures takes the opposite approach: a document-based editor inspired by Jupyter Notebooks and Notion. You start by describing what you want in plain English (probabilistic), then progressively add deterministic elements inline — branching logic, data connectors, code blocks — only when needed. It echoes Stephen Wolfram's aspiration of 'programming in which one is as directly as possible expressing computational thinking.' The result is a blend of agentic and specific, with progressive complexity.\n\nThe deeper insight is about the central UI design challenge of the AI era: how do we combine deterministic interfaces (predictable, if-then-else) with probabilistic ones (fuzzy, AI-driven)? The author believes the primary user interfaces of the future will be the ones that most gracefully blend both. OpenAI is building generic multi-agent infrastructure; Fin is building domain-specific customer support tooling — different goals explaining different design choices, but both wrestling with the same fundamental tension.",
    "tags": ["ai", "design", "product"]
  },
  {
    "url": "https://blog.cloudflare.com/code-mode/",
    "title": "Code Mode: the better way to use MCP",
    "date": "12/10/2025 - 16:56",
    "summary": "Cloudflare's engineering team (Kenton Varda and Sunil Pai) discovered that the standard way everyone uses MCP (Model Context Protocol) is suboptimal — and possibly fundamentally wrong. Instead of exposing tools directly to the LLM for function calling, they convert MCP tools into a TypeScript API and ask the LLM to write code that calls that API.\n\nThe results are striking for two reasons:\n\n1) LLMs handle far more tools, and more complex tools, when presented as TypeScript interfaces. This is because LLMs have trained on enormous amounts of real-world TypeScript, but only on a small set of contrived tool-call examples. Tool calling relies on special tokens the LLM has rarely seen in the wild — they must be specially trained via synthetic data. Code, on the other hand, is something LLMs have seen billions of lines of.\n\n2) The approach dramatically improves multi-step workflows. With traditional tool calling, the output of each call feeds back through the LLM's neural network just to be copied to the next call input — wasting time, energy, and tokens. When the LLM writes code, it chains calls directly in a single execution, only reading back final results.\n\nThe article dives deep into how tool calling actually works under the hood: special non-textual tokens that signal 'tool call start' and 'tool call end,' JSON payloads between them, the harness pausing execution, and results fed back via another set of special tokens. It explains why MCP server designers are encouraged to present simplified APIs — because LLMs struggle with complex tool schemas — and how Code Mode removes that limitation entirely.\n\nIn short: LLMs are better at writing code to call MCP than at calling MCP directly. The implications for how we design agent architectures are significant.",
    "tags": ["ai", "engineering", "frontend"]
  },
  {
    "url": "https://www.kalzumeus.com/2009/12/31/engineering-your-way-to-marketing-success/",
    "title": "Engineering Your Way To Marketing Success",
    "date": "11/08/2025 - 13:56",
    "summary": "Patrick McKenzie (patio11) — one of the most respected voices in indie software — makes the case that engineers should stop building features nobody uses and start deploying their coding skills for marketing. The core insight: the software industry sits on more engineering talent than Saudi Arabia has oil, yet we waste it building marginal features instead of systems that actually drive sales.\n\nHe shares a painful personal example from Bingo Card Creator: spending enormous time on client/server sync (used by exactly 22 customers — 1% adoption) versus adding color support (took 1/10th the time, used by 8.5% of customers). The lesson: features don't sell software — benefits do. Customers don't care about PPT file internals; they care about closing deals and getting promoted.\n\nThe article covers several powerful engineering-to-marketing conversions:\n- Automated SEO at scale: building systems to generate thousands of pages of targeted content (he wrote 28,761 words of bingo activities — a young-adult novel's worth — but built the system to let freelancers do it)\n- A/B testing everything relentlessly: not as one-off experiments but as a cultural process\n- Building analytics systems that answer real questions like 'Do customers feel like they just killed a lion?'\n- Creating tools and processes as force multipliers — the key to decoupling productivity from hours worked\n\nThe meta-lesson: instead of grinding out content or features yourself, build a system that lets someone else do it efficiently, then spend your time building more force multipliers. This compounding effect is what separates growing businesses from stagnant ones.",
    "tags": ["marketing", "engineering", "startup"]
  },
  {
    "url": "https://alexw.substack.com/p/do-too-much",
    "title": "DO TOO MUCH",
    "date": "10/08/2025 - 23:06",
    "summary": "Alex Wang, CEO of Scale AI, makes a provocative argument: what most people would call excessive effort is actually the baseline for building anything extraordinary. 'Too much' is the right amount.\n\nAs a leader, you are the upper bound for how much anyone in your company will care. His reframes cut deep:\n- What people call overoptimism is just optimism\n- What people call overcommunicating is just communicating\n- What people call overdelivering is just delivering\n- What people call micromanagement is just management\n- What people call ruthless prioritization is just prioritization\n\nHe backs this with examples: there is no Apple without Jobs's 'obsessive' attention to detail. No SpaceX or Tesla without Elon's 'maniacal' drive for execution. He has never seen ordinary effort lead to extraordinary results.\n\nThe concrete Scale AI example is compelling: when generative AI took off in 2022, Scale shifted the vast majority of their team to LLM data generation within 6 months. Most companies would have spent quarters in bureaucratic planning cycles, only moving after a competitor started eating their lunch. The change was 'drastic and abrupt — some might say jarring or extreme.' But what people described as overreacting was just reacting. That speed made Scale's subsequent 4X growth possible.\n\nThe essay's closing is powerful: 'Creating something meaningful is a beautiful, and yes, scary and painful thing. And if you're not overdoing it, you're underdoing it.' Scale will do things incumbent companies won't because it's too scary or painful — and that's a feature, not a bug.",
    "tags": ["leadership", "startup", "productivity"]
  },
  {
    "url": "https://zenorocha.com/the-heartbeat-framework",
    "title": "The Heartbeat Framework — Zeno Rocha",
    "date": "10/08/2025 - 22:55",
    "summary": "Zeno Rocha, founder of Resend, codifies how startups maintain momentum into a framework he calls 'The Heartbeat.' The core premise is deceptively simple but hard to execute: getting momentum is extremely hard, losing it is very easy. As makers, you not only have to ship software — you have to ship AND talk about it. Constantly. If you want to create a feeling of 'always shipping,' you need a rhythm.\n\nThe framework works like an actual heartbeat — big peaks followed by small peaks, with the beat always present. A flat line means you're dead. No momentum. The balance between big and small peaks matters, but the beat must never stop.\n\nThe six layers, from highest impact to highest frequency:\n\nA) Launch Weeks (2-3x/year) — The big peaks. 5 new features in 5 days. Most impactful but highest cost to the team. Don't do them too frequently.\n\nB) Mini-Launches (4-5x/year) — Small wins worth sharing in detail, without the full coordination overhead of a Launch Week.\n\nC) Changelogs (1-2x/month) — Regular product updates showing evolution. Pro tip: create an internal streak to motivate the team so you never miss a cycle.\n\nD) Blog posts (1-2x/month) — Nothing is more telling than a company blog with the last post from a year ago. It signals death.\n\nE) Customer stories (1-2x/month) — Real developer experiences. Crucial for attracting new customers AND keeping the internal team motivated with proof that the product matters.\n\nF) Social posts (1x/day) — Be very active but in only a few places. For Resend, X and LinkedIn worked best.\n\nEach layer has real-life examples from Resend's own execution. The framework has been widely adopted by developer-focused startups as a practical playbook for developer marketing.",
    "tags": ["marketing", "startup", "product"]
  },
  {
    "url": "https://www.youtube.com/watch?v=_yhSh4g0NSk",
    "title": "I Hate Next.js 13 Caching Even More Now",
    "date": "10/08/2025 - 22:45",
    "summary": "A YouTube video deep-diving into the widespread frustrations developers face with Next.js 13's caching system. Next.js 13 introduced multiple caching layers — the Data Cache, Full Route Cache, and Router Cache — that interact in complex and often surprising ways.\n\nThe video walks through real scenarios where caching behavior is unintuitive: stale data appears when you expect fresh data, revalidation doesn't work as documented, and developers end up spending more time fighting the cache than building features. The Router Cache in particular was controversial because it cached client-side navigations by default with no easy way to opt out.\n\nThis critique resonated deeply with the React/Next.js community because it captured a sentiment many developers felt but couldn't articulate: the caching was too aggressive, too opaque, and too hard to debug. It became one of the most-shared critiques of Next.js 13's architecture and likely influenced the simplified caching defaults in later versions. A must-watch for anyone working with Next.js who has ever muttered 'why is this showing old data?'",
    "tags": ["frontend", "engineering"]
  },
  {
    "url": "https://buka.studio/",
    "title": "Buka Studio",
    "date": "10/08/2025 - 22:35",
    "summary": "Buka Studio (ブカ) is a design-development duo based in Croatia, run by Marijana (designer) and Robert (developer). They help founders turn ideas into products and brands, working closely with teams they believe in.\n\nTheir philosophy centers on a principle that's increasingly rare: design and code should move together so nothing gets lost in translation. Too many studios separate design from implementation, leading to pixel-perfect mockups that fall apart in production. Buka avoids this by having both disciplines work in tandem from day one.\n\nThey're drawn to new ideas and dive in fast, exploring broadly. Whether shaping early-stage concepts, refining products already in production, or crafting bold visuals for one-off moments, they ensure everything feels cohesive and on-brand. They're not a large agency — they're a small, focused, high-quality product studio that picks projects they genuinely believe in.\n\nA great reference for what a modern, lean design-dev partnership looks like: no bureaucracy, no account managers, just a designer and developer who ship together. Based in Croatia, available remotely.",
    "tags": ["design", "startup"]
  }
]
